---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IDropHandler
source: html/d85b08f1-3347-17d1-b502-5ea5ecd8ffc2.htm
---
# IDropHandler Members

Implement this method to handle the drop event for your data.